app/controllers/admin/archiwes_controller.rb

SELECT * FROM `magazines` WHERE (`magazines`.`status` = '1')
---
  def index
    @archiwes = Magazine.find(:all, :conditions => {:status => '1'})