app/controllers/admin/covers_controller.rb

  def new
    @magazine = Magazine.find(params[:magazine_id])
---
SELECT * FROM `magazines` WHERE (`magazines`.`id` = 29)