app/controllers/admin/egalleryps_controller.rb

  def move
    @egalleryp = Egalleryp.find(params[:id])
---
SELECT * FROM `egalleryps` WHERE (`egalleryps`.`egallery_id` = 7 AND position = 2) LIMIT 1