app/controllers/admin/egalleries_controller.rb

  def index
    @egalleries = Egallery.all(:order => "id DESC")
---
SELECT * FROM `egalleries` ORDER BY id DESC

  def show
    @egallery = Egallery.find(params[:id])
    @egalleryps = Egalleryp.all(:conditions => {:egallery_id => params[:id]})
---
SELECT * FROM `egalleries` WHERE (`egalleries`.`id` = 7)
SELECT * FROM `egalleryps` WHERE (`egalleryps`.`egallery_id` = '7')

  def edit
    @egallery = Egallery.find(params[:id])
    @egalleryps = Egalleryp.find(:all, :conditions => {:egallery_id => params[:id]},
    :order => :position)
---
SELECT * FROM `egalleries` WHERE (`egalleries`.`id` = 7)
SELECT * FROM `egalleryps` WHERE (`egalleryps`.`egallery_id` = '7') ORDER BY position