app/controllers/admin/events_controller.rb

  def index
	@events = Event.lista(params[:page], params[:magazine_id])
  @magazine = Magazine.find(:all, :conditions => {:id => params[:magazine_id]})
---
SELECT * FROM `magazines` WHERE (`magazines`.`id` = '35')

  def show
    @event = Event.find(params[:id])
    @egalleries = Egallery.find(:all)
    @eventdays = Eventday.find(:all, :conditions => {:event_id => params[:id]})
---
SELECT * FROM `events` WHERE (`events`.`id` = 193)
SELECT * FROM `eventdays` WHERE (`eventdays`.`event_id` = '193')

  def new
    @event = Event.new
    @magazine = Magazine.find(:all, :conditions => {:id => params[:magazine_id]})
---
SELECT start_date FROM `magazines` WHERE (`magazines`.`id` = 36)

  def edit
    @event = Event.find(params[:id])
    @eventdays = Eventday.find(:all, :conditions => {:event_id => params[:id]})
    @magazine = Magazine.find(:all, :conditions => {:id => params[:magazine_id]})
---
SELECT * FROM `events` WHERE (`events`.`id` = 193)
SELECT * FROM `eventdays` WHERE (`eventdays`.`event_id` = '193')
SELECT start_date FROM `magazines` WHERE (`magazines`.`id` = 35)

  def create

 hour = params[:event][:"start_time(4i)"]
 minute = params[:event][:"start_time(5i)"]

@event = Event.create(params[:event])

params[:event][:when].split(';').map do |e|
	@event.eventdays.create :pday => DateTime.parse("#{hour}:#{minute} #{e}")
---
INSERT INTO `events` (`price`, `place_id`, `created_at`, `title`, `body`, `updated_at`, `magazine_id`, `e`, `category_id`, `start_time`, `more`) VALUES('', 1, '2011-01-10 18:06:24', 't', '<p>t</p>', '2011-01-10 18:06:24', 36, 0, 2, '2011-01-10 18:06:00', '<p>t</p>')
INSERT INTO `eventdays` (`created_at`, `event_id`, `pday`, `updated_at`) VALUES('2011-01-10 18:06:24', 205, '2011-01-10 18:06:00', '2011-01-10 18:06:24')

  def update
#    return render :text => "parametry => #{params.to_yaml}"
#    params[:event][:update_id]
#return render :text => "#{params[:id].to_yaml}"
    @old = Eventday.find(:all, :conditions => {:event_id => params[:id]})
           Eventday.destroy_all(:id => @old)
#??           Event.destroy(params[:id])
@event = Event.find(:first, :conditions => {:id => params[:id]})
 hour = params[:event][:"start_time(4i)"]
 minute = params[:event][:"start_time(5i)"]

#      return render :text => "#{params.to_yaml}"
 # @event = Event.create(params[:event])

    params[:event][:when].split(';').map do |e|
	    @event.eventdays.create :pday => DateTime.parse("#{hour}:#{minute} #{e}")
    end

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM `eventdays` WHERE (`eventdays`.`id` IN (1725,1726,1727,1728,1729,1730,1731,1732,1733,1734,1735))
DELETE FROM `eventdays` WHERE `id` = 1725
SELECT * FROM `events` WHERE (`events`.`id` = '193') LIMIT 1
INSERT INTO `eventdays` (`created_at`, `event_id`, `pday`, `updated_at`) VALUES('2010-10-21 11:57:58', 193, '2010-10-21 08:44:00', '2010-10-21 11:57:58')
UPDATE `events` SET `updated_at` = '2011-01-10 18:34:02', `price` = '10', `body` = '<p>t</p>\r\n<p>{gallery=6}</p>' WHERE `id` = 205