app/controllers/admin/eventsorts_controller.rb

SELECT * FROM `magazines` WHERE (`magazines`.`id` = 36)
SELECT * FROM `places` WHERE (`places`.`id` = 1)
SELECT count(*) AS count_all FROM `places`
---
  def index
#    @miejsca = Place.all
      @miejsca = Magazine.find(params[:magazine_id]).miejsce
    @kolejnosc = Magazine.find(params[:magazine_id]).miejsce
#    return render :text => "dupa #{@kolejnosc.nil?}"

      if @kolejnosc.nil? then
#        return render :text => "dupa"
#         @kolejnosc =  @miejsca.collect{|y| y.id }.join(';')
##          @kolejnosc = '1;2;3'
##          @miejsca = '1;2;3'
          @miejsca = Place.count.times.map {|c| c +1}.join(";")

SELECT * FROM `magazines` WHERE (`magazines`.`id` = 36)
UPDATE `magazines` SET `updated_at` = '2011-01-10 18:14:47', `miejsce` = '3;2;1' WHERE `id` = 36
---
  def update
        @magazyn = Magazine.find(params[:eventsort][:id])
    respond_to do |format|
      if @magazyn.update_attributes(params[:eventsort])