app/controllers/admin/iadres_controller.rb

  def index
    @iadres = Iadre.all(:order => :position)
---
SELECT * FROM `iadres` ORDER BY position