app/controllers/admin/magazines_controller.rb

SELECT * FROM `magazines` WHERE (`magazines`.`id` IN ('35'))
UPDATE `magazines` SET `updated_at` = '2011-01-10 18:05:38', `status` = 1 WHERE `id` = 35
---
  def arch
		@magazines = Magazine.find(:all, :conditions => {:id => params[:magazine_ids]})
      @magazines.each do |ids|
			  Magazine.update(ids.id, :status => '1')

SELECT * FROM `magazines` WHERE (`magazines`.`status` = '0') ORDER BY start_date DESC
---
  def index
    @magazines = Magazine.all(:conditions => {:status => '0'}, :order => "start_date DESC")

SELECT * FROM `magazines` WHERE (`magazines`.`id` = 35)
---
  def show
    @magazine = Magazine.find(params[:id])

SELECT * FROM `magazines` WHERE (`magazines`.`start_date` = '2011-1-1 00:00:00') LIMIT 1
INSERT INTO `magazines` (`start_date`, `position`, `miejsce`, `created_at`, `updated_at`, `miejsca`, `status`) VALUES('2011-01-01 00:00:00', NULL, NULL, '2011-01-10 18:05:41', '2011-01-10 18:05:41', NULL, 0)
---
  def create
#return render :text => "parametry -> #{params[:eventsort][:"start_date(1i)"].to_yaml}"
#    nowy = params[:magazine][:"start_date(1i)"]+"-"+params[:magazine][:"start_date(2i)"]+"-1 00:00:00"
nowy = params[:eventsort][:"start_date(1i)"]+"-"+params[:eventsort][:"start_date(2i)"]+"-1 00:00:00"
#return render :text => "dd -> #{nowy}"
if Magazine.first(:conditions => {:start_date => nowy})

      flash[:notice] = "Nie można dodać tego numeru! taki istnieje!."
      redirect_to admin_magazines_path
else

#    @magazine = Magazine.new(params[:magazine])
    @magazine = Magazine.new(params[:eventsort])
    respond_to do |format|
      if @magazine.save