app/controllers/admin/notis_controller.rb

SELECT * FROM `zgloszenias` ORDER BY created_at ASC
---
  def index
    @notis = Zgloszenia.all(:order=> "created_at ASC")

SELECT * FROM `zgloszenias` WHERE (`zgloszenias`.`id` = 6)
---
  def show
    @noti = Zgloszenia.find(params[:id])