app/controllers/admin/places_controller.rb

  def index
    @places = Place.all
---
SELECT * FROM `places`