app/controllers/admin/soons_controller.rb

  def move
#		return render :text => "Jestem w move #{params.to_yaml}:)"
	    @soon=Soon.find(params[:id])
---
SELECT * FROM `soons` WHERE (`soons`.`id` = 8)

  def index
    #zmienić aby wyszukiwał tylko z bieżącego numeru
    @magazine = Magazine.find(:all, :conditions => {:id => params[:magazine_id]})
    @soons = Soon.find(:all,:conditions => {:magazine_id => params[:magazine_id]}, :order => :position)
---
SELECT * FROM `magazines` WHERE (`magazines`.`id` = '36')
SELECT * FROM `soons` WHERE (`soons`.`magazine_id` = '36') ORDER BY position

  def create
    @soon = Soon.new(params[:soon])

    respond_to do |format|
      if @soon.save
---
INSERT INTO `soons` (`position`, `created_at`, `title`, `updated_at`, `magazine_id`) VALUES(1, '2011-01-10 18:11:39', '4', '2011-01-10 18:11:39', 36)

  def destroy
    @soon = Soon.find(params[:id])
    @soon.destroy
---
SELECT * FROM `soons` WHERE (`soons`.`id` = 8)
DELETE FROM `soons` WHERE `id` = 8