app/controllers/admin/sponsors_controller.rb

SELECT * FROM `sponsors`
SELECT * FROM `magazines` WHERE (`magazines`.`id` IS NULL)
---
  def index
    @sponsors = Sponsor.all
    @magazine = Magazine.find(:all, :conditions => {:id => params[:magazine_id]})