app/controllers/admin/topones_controller.rb

  def move
	    @topone=Topone.find(params[:id])
---
SELECT * FROM `topones` WHERE (`topones`.`id` = 17)

  def index
    #zminić aby wyszukiwał tylko z bieżącego numeru
    @topones = Topone.find(:all, :conditions => {:magazine_id => params[:magazine_id]},:order => :position)
    @magazine = Magazine.find(:all, :conditions => {:id => params[:magazine_id]})
---
SELECT * FROM `topones` WHERE (`topones`.`magazine_id` = '35') ORDER BY position
SELECT * FROM `magazines` WHERE (`magazines`.`id` = '35')

  def edit
    @topone = Topone.find(params[:id])
    @all_sponsors = Sponsor.find(:all)
    @sponsors = Topone.find(params[:id]).sponsors
---
SELECT * FROM `topones` WHERE (`topones`.`id` = 16)
SELECT `sponsors`.id FROM `sponsors` INNER JOIN `sponsorizations` ON `sponsors`.id = `sponsorizations`.sponsor_id WHERE (`sponsors`.`id` = 6) AND ((`sponsorizations`.topone_id = 16)) LIMIT 1

  def create
#    return render :text => "podaję parametry-> #{params.to_yaml}"
    @topone = Topone.new(params[:topone])

    respond_to do |format|
      if @topone.save
---
INSERT INTO `topones` (`position`, `place_id`, `created_at`, `title`, `body`, `updated_at`, `magazine_id`, `category_id`, `more`) VALUES(1, 2, '2010-10-21 11:59:21', 'Pierwy', '<p>Titale title Title title Title title Title title Title title {gallery=6}Title title Title title Title title Title title Title title Title title Title title Title title Title title Title title Title title Title title Title title Title title Title title Title title Title title Title title Title title Title</p>', '2010-10-21 11:59:21', 35, 2, NULL)

  def update
    @topone = Topone.find(params[:id])

    if params[:topone][:sponsor_ids].nil?
      Sponsorization.destroy_all(:topone_id => params[:id] )
#      return render :text => "#{@topone.sponsorization.to_yaml}"
    end
    respond_to do |format|
      if @topone.update_attributes(params[:topone])
---
SELECT * FROM `topones` WHERE (`topones`.`id` = 16)
UPDATE `topones` SET `updated_at` = '2011-01-10 18:34:57', `body` = '<p>TG2</p>\r\n<p>{gallery=6}</p>' WHERE `id` = 17