app/controllers/admin/users_controller.rb

    def index
    @users = User.all(:order => :position)
---
SELECT * FROM `users` ORDER BY position