app/controllers/kalendarium_controller.rb

SELECT * FROM `magazines` WHERE (`magazines`.`start_date` = '2010-10-1') LIMIT 1
SELECT * FROM `magazines` WHERE (`magazines`.`id` = 35)
SELECT * FROM `soons` WHERE (`soons`.`magazine_id` = 35) ORDER BY position
---
def index
    if !params[:id].nil?
        nie_puste(params[:id])
     @notes = Event.day_range(params[:id].to_date)
      else
        puste
     @notes = Event.day_range(Time.now)
      end

    if !Magazine.first(:conditions => {:start_date => @numer }).nil? then
    #magazine wyszukuje magazyn z bazy
    @magazine = Magazine.first(:conditions => {:start_date => @numer })
    # soons w któtce
    @soons = Soon.find(:all, :conditions => {:magazine_id => @magazine.id}, :order => :position)