app/controllers/muzyka_controller.rb

SELECT * FROM `magazines` WHERE (`magazines`.`start_date` = '2011-1-1') LIMIT 1
SELECT * FROM `magazines` WHERE (`magazines`.`id` = 36)
SELECT * FROM `soons` WHERE (`soons`.`magazine_id` = 36) ORDER BY position
SELECT * FROM `events` WHERE (`events`.`magazine_id` = 36 AND `events`.`category_id` = 3)
---
def index
        if !params[:id].nil?
            nie_puste(params[:id])
        else
            puste
        end

   if !Magazine.first(:conditions => {:start_date => @numer }).nil? then
           #magazine wyszukuje magazyn z bazy
@magazine = Magazine.first(:conditions => {:start_date => @numer })
           # soons w któtce
@soons = Soon.find(:all, :conditions => {:magazine_id => @magazine.id}, :order=> :position)
       else
         render :action => :index, :id => Date.today.year.to_s+"-"+Date.today.month.to_s+"-1"
       end
#4 to muzyka
    @muzyka = Event.all(:conditions => {:category_id => 3, :magazine_id => @magazine})