app/controllers/wydarzenia_controller.rb

  def index
      if !params[:id].nil?
        nie_puste(params[:id])
     @notes = Event.date_range(Time.now)
      else
        puste
      end

    #????????????????????????????????????????????????????????#
    if !Magazine.first(:conditions => {:start_date => @numer }).nil? then
    #magazine wyszukuje magazyn z bazy
     @magazine = Magazine.first(:conditions => {:start_date => @numer })
    # soons w któtce
     @soons = Soon.find(:all, :conditions => {:magazine_id => @magazine.id}, :order => :position)
    #importend adress, ważne adresy
     @iadres = Iadre.all(:order => :position)
    #wydarzenia główne
 @notes = Event.date_range(Time.now)
     #sprawdza czy istnieje kolejnosc wyświetlania wydarzenień jeżeli nie tymczasowo
     #segreguje wg kolejności kluczy id

     if @magazine.miejsce == 'NULL' then
        @magazine.miejsce =  Place.all.collect{|y| y.id }.join(';')
     end

 @kolejnosc = @magazine.miejsce
 @miejsca = Place.all
if !@wydarzenia.nil?
 @wydarzenia =  @kolejnosc.split(';')
end
    @topones = Topone.all(:conditions => {:magazine_id => @magazine.id }, :order => :position)
    #obsługa generowania galerii wewnątrz artykułów
        @topones.each do |topone|
          gallery_id = topone.body.scan(/\{gallery=(\d+)\}/).flatten[0]
            if !Egallery.find(:first, :conditions => {:id, gallery_id}).nil?
---
SELECT * FROM `magazines` WHERE (`magazines`.`start_date` = '2010-10-1') LIMIT 1
SELECT * FROM `magazines` WHERE (`magazines`.`id` = 35)
SELECT * FROM `soons` WHERE (`soons`.`magazine_id` = 35) ORDER BY position
SELECT * FROM `iadres` ORDER BY position
SELECT * FROM `places` WHERE (`places`.`id` = 3)
SELECT * FROM `topones` WHERE (`topones`.`magazine_id` = 35) ORDER BY position
SELECT * FROM `egalleries` WHERE (`egalleries`.`id` IS NULL) LIMIT 1