app/controllers/zgloszenias_controller.rb

SELECT * FROM `magazines` WHERE (`magazines`.`start_date` = '2011-1-1') LIMIT 1
SELECT * FROM `magazines` WHERE (`magazines`.`id` = 36)
SELECT * FROM `soons` WHERE (`soons`.`magazine_id` = 36) ORDER BY position
---
  def index
    #####################
    if !params[:id].nil?
        nie_puste(params[:id])
      else
        puste
      end

      if !Magazine.first(:conditions => {:start_date => @numer }).nil? then
       #magazine wyszukuje magazyn z bazy
       @magazine = Magazine.first(:conditions => {:start_date => @numer })
       # soons w któtce
       @soons = Soon.find(:all, :conditions => {:magazine_id => @magazine.id}, :order => :position)